tutorials/incompressible/simpleFoam/ERCOFTAC_ConicalDiffuser/Case1.1_GGI/constant/swirlAndRotationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      swirlAndRotationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

modifyBoundaries   yes;

modifyInterior     yes;

omega              omega [0 2 -1 0 0 0 0] (0.0 0.0 52.646);

center             center [0 0 0 0 0 0 0] (0.0 0.0 0.0);

rotatingPatches    (
                   inlet
                   rotSwirlWallA_BB
                   );

// ************************************************************************* //
