tutorials/incompressible/simpleFoam/ERCOFTAC_ConicalDiffuser/Case1.1_GGI/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet           
    {
        type            zeroGradient;
    }

    outlet          
    {
// outlet BC: zeroGradient
//        type            zeroGradient;

// outlet BC: fixedMeanValue, available in 1.4.1-dev
//        type            fixedMeanValue;
//        meanValue       0;

// outlet BC: fixedValue
        type            fixedValue;
        value           uniform 0;
    }

    wallProlongation
    {
        type            zeroGradient;
    }

    wallDiffuser
    {
        type            zeroGradient;
    }

    statSwirlWallB_C
    {
        type            zeroGradient;
    }

    rotSwirlWallA_BB
    {
        type            zeroGradient;
    }

    B_UPSTREAM
    {
        type            ggi;
    }

    B_DOWNSTREAM
    {
        type            ggi;
    }
}

// ************************************************************************* //
